NoMaY-jp/FreeRTOS/FreeRTOS/Demo/RL78_RL78G23_64p_FPB_IAR_e2studio_EWRL78/src/smc_gen/r_bsp/mcu/rl78_g23/register_access/iccrl/ior7f100g.h
__sfr __no_init volatile union
{
  unsigned char PM0;
  __BITS8       PM0_bit;
} @ 0xFFF20;

__sfr __no_init volatile union
{
  unsigned char PM1;
  __BITS8       PM1_bit;
} @ 0xFFF21;

__sfr __no_init volatile union
{
  unsigned char PM2;
  __BITS8       PM2_bit;
} @ 0xFFF22;

__sfr __no_init volatile union
{
  unsigned char PM3;
  __BITS8       PM3_bit;
} @ 0xFFF23;

__sfr __no_init volatile union
{
  unsigned char PM4;
  __BITS8       PM4_bit;
} @ 0xFFF24;

__sfr __no_init volatile union
{
  unsigned char PM5;
  __BITS8       PM5_bit;
} @ 0xFFF25;

__sfr __no_init volatile union
{
  unsigned char PM6;
  __BITS8       PM6_bit;
} @ 0xFFF26;

__sfr __no_init volatile union
{
  unsigned char PM7;
  __BITS8       PM7_bit;
} @ 0xFFF27;

__sfr __no_init volatile union
{
  unsigned char PM8;
  __BITS8       PM8_bit;
} @ 0xFFF28;

__sfr __no_init volatile union
{
  unsigned char PM9;
  __BITS8       PM9_bit;
} @ 0xFFF29;

__sfr __no_init volatile union
{
  unsigned char PM10;
  __BITS8       PM10_bit;
} @ 0xFFF2A;

__sfr __no_init volatile union
{
  unsigned char PM11;
  __BITS8       PM11_bit;
} @ 0xFFF2B;

__sfr __no_init volatile union
{
  unsigned char PM12;
  __BITS8       PM12_bit;
} @ 0xFFF2C;

__sfr __no_init volatile union
{
  unsigned char PM14;
  __BITS8       PM14_bit;
} @ 0xFFF2E;

__sfr __no_init volatile union
{
  unsigned char PM15;
  __BITS8       PM15_bit;
} @ 0xFFF2F;

__sfr __no_init volatile union
{
  unsigned char ADM0;
  __BITS8       ADM0_bit;
  struct
  {
    unsigned char  ADCE:1;
    unsigned char  :6;
    unsigned char  ADCS:1;
  };
} @ 0xFFF30;

__sfr __no_init volatile union
{
  unsigned char ADS;
  __BITS8       ADS_bit;
} @ 0xFFF31;

__sfr __no_init volatile union
{
  unsigned char ADM1;
  __BITS8       ADM1_bit;
} @ 0xFFF32;

__sfr __no_init volatile union
{
  unsigned char KRCTL;
  __BITS8       KRCTL_bit;
  struct
  {
    unsigned char  KREG:1;
    unsigned char  :6;
    unsigned char  KRMD:1;
  };
} @ 0xFFF34;

__sfr __no_bit_access __no_init volatile union
{
  unsigned char KRF;
  __BITS8       KRF_bit;
} @ 0xFFF35;

__sfr __no_init volatile union
{
  unsigned char KRM0;
  __BITS8       KRM0_bit;
} @ 0xFFF37;

__sfr __no_init volatile union
{
  unsigned char EGP0;
  __BITS8       EGP0_bit;
} @ 0xFFF38;

__sfr __no_init volatile union
{
  unsigned char EGN0;
  __BITS8       EGN0_bit;
} @ 0xFFF39;

__sfr __no_init volatile union
{
  unsigned char EGP1;
  __BITS8       EGP1_bit;
} @ 0xFFF3A;

__sfr __no_init volatile union
{
  unsigned char EGN1;
  __BITS8       EGN1_bit;
} @ 0xFFF3B;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short SDR02;
  __BITS16       SDR02_bit;
  struct
  {
    union
    {
      unsigned char SIO10;
      __BITS8       SIO10_bit;
      unsigned char TXD1;
      __BITS8       TXD1_bit;
    };
    unsigned char :8;
  };
} @ 0xFFF44;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short SDR03;
  __BITS16       SDR03_bit;
  struct
  {
    union
    {
      unsigned char RXD1;
      __BITS8       RXD1_bit;
      unsigned char SIO11;
      __BITS8       SIO11_bit;
    };
    unsigned char :8;
  };
} @ 0xFFF46;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short SDR10;
  __BITS16       SDR10_bit;
  struct
  {
    union
    {
      unsigned char SIO20;
      __BITS8       SIO20_bit;
      unsigned char TXD2;
      __BITS8       TXD2_bit;
    };
    unsigned char :8;
  };
} @ 0xFFF48;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short SDR11;
  __BITS16       SDR11_bit;
  struct
  {
    union
    {
      unsigned char RXD2;
      __BITS8       RXD2_bit;
      unsigned char SIO21;
      __BITS8       SIO21_bit;
    };
    unsigned char :8;
  };
} @ 0xFFF4A;

__sfr __no_bit_access __no_init volatile union
{
  unsigned char IICA0;
  __BITS8       IICA0_bit;
} @ 0xFFF50;

__sfr __no_init volatile const union
{
  unsigned char IICS0;
  __BITS8       IICS0_bit;
  struct
  {
    unsigned char  SPD0:1;
    unsigned char  STD0:1;
    unsigned char  ACKD0:1;
    unsigned char  TRC0:1;
    unsigned char  COI0:1;
    unsigned char  EXC0:1;
    unsigned char  ALD0:1;
    unsigned char  MSTS0:1;
  };
} @ 0xFFF51;

__sfr __no_init volatile union
{
  unsigned char IICF0;
  __BITS8       IICF0_bit;
  struct
  {
    unsigned char  IICRSV0:1;
    unsigned char  STCEN0:1;
    unsigned char  :4;
    unsigned char  IICBSY0:1;
    unsigned char  STCF0:1;
  };
} @ 0xFFF52;

__sfr __no_bit_access __no_init volatile union
{
  unsigned char IICA1;
  __BITS8       IICA1_bit;
} @ 0xFFF54;

__sfr __no_init volatile const union
{
  unsigned char IICS1;
  __BITS8       IICS1_bit;
  struct
  {
    unsigned char  SPD1:1;
    unsigned char  STD1:1;
    unsigned char  ACKD1:1;
    unsigned char  TRC1:1;
    unsigned char  COI1:1;
    unsigned char  EXC1:1;
    unsigned char  ALD1:1;
    unsigned char  MSTS1:1;
  };
} @ 0xFFF55;

__sfr __no_init volatile union
{
  unsigned char IICF1;
  __BITS8       IICF1_bit;
  struct
  {
    unsigned char  IICRSV1:1;
    unsigned char  STCEN1:1;
    unsigned char  :4;
    unsigned char  IICBSY1:1;
    unsigned char  STCF1:1;
  };
} @ 0xFFF56;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short TDR02;
  __BITS16       TDR02_bit;
} @ 0xFFF64;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short TDR03;
  __BITS16       TDR03_bit;
  struct
  {
    union
    {
      unsigned char TDR03L;
      __BITS8       TDR03L_bit;
    };
    union
    {
      unsigned char TDR03H;
      __BITS8       TDR03H_bit;
    };
  };
} @ 0xFFF66;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short TDR04;
  __BITS16       TDR04_bit;
} @ 0xFFF68;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short TDR05;
  __BITS16       TDR05_bit;
} @ 0xFFF6A;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short TDR06;
  __BITS16       TDR06_bit;
} @ 0xFFF6C;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short TDR07;
  __BITS16       TDR07_bit;
} @ 0xFFF6E;

