NoMaY-jp/FreeRTOS/FreeRTOS/Demo/RL78_RL78G23_64p_FPB_IAR_e2studio_EWRL78/src/smc_gen/r_bsp/mcu/rl78_g23/register_access/iccrl/ior7f100g.h
__sfr __no_bit_access __no_init volatile union
{
  unsigned short TDR10;
  __BITS16       TDR10_bit;
} @ 0xFFF70;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short TDR11;
  __BITS16       TDR11_bit;
  struct
  {
    union
    {
      unsigned char TDR11L;
      __BITS8       TDR11L_bit;
    };
    union
    {
      unsigned char TDR11H;
      __BITS8       TDR11H_bit;
    };
  };
} @ 0xFFF72;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short TDR12;
  __BITS16       TDR12_bit;
} @ 0xFFF74;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short TDR13;
  __BITS16       TDR13_bit;
  struct
  {
    union
    {
      unsigned char TDR13L;
      __BITS8       TDR13L_bit;
    };
    union
    {
      unsigned char TDR13H;
      __BITS8       TDR13H_bit;
    };
  };
} @ 0xFFF76;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short TDR14;
  __BITS16       TDR14_bit;
} @ 0xFFF78;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short TDR15;
  __BITS16       TDR15_bit;
} @ 0xFFF7A;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short TDR16;
  __BITS16       TDR16_bit;
} @ 0xFFF7C;

__sfr __no_bit_access __no_init volatile union
{
  unsigned short TDR17;
  __BITS16       TDR17_bit;
} @ 0xFFF7E;

__sfr __no_bit_access __no_init volatile union
{
  unsigned char CMC;
  __BITS8       CMC_bit;
} @ 0xFFFA0;

__sfr __no_init volatile union
{
  unsigned char CSC;
  __BITS8       CSC_bit;
  struct
  {
    unsigned char  HIOSTOP:1;
    unsigned char  MIOEN:1;
    unsigned char  :4;
    unsigned char  XTSTOP:1;
    unsigned char  MSTOP:1;
  };
} @ 0xFFFA1;

__sfr __no_init volatile const union
{
  unsigned char OSTC;
  __BITS8       OSTC_bit;
} @ 0xFFFA2;

__sfr __no_bit_access __no_init volatile union
{
  unsigned char OSTS;
  __BITS8       OSTS_bit;
} @ 0xFFFA3;

__sfr __no_init volatile union
{
  unsigned char CKC;
  __BITS8       CKC_bit;
  struct
  {
    unsigned char  MCM1:1;
    unsigned char  MCS1:1;
    unsigned char  :2;
    unsigned char  MCM0:1;
    unsigned char  MCS:1;
    unsigned char  CSS:1;
    unsigned char  CLS:1;
  };
} @ 0xFFFA4;

__sfr __no_init volatile union
{
  unsigned char CKS0;
  __BITS8       CKS0_bit;
  struct
  {
    unsigned char  :7;
    unsigned char  PCLOE0:1;
  };
} @ 0xFFFA5;

__sfr __no_init volatile union
{
  unsigned char CKS1;
  __BITS8       CKS1_bit;
  struct
  {
    unsigned char  :7;
    unsigned char  PCLOE1:1;
  };
} @ 0xFFFA6;

__sfr __no_init volatile union
{
  unsigned char CKSEL;
  __BITS8       CKSEL_bit;
  struct
  {
    unsigned char  SELLOSC:1;
    unsigned char  :7;
  };
} @ 0xFFFA7;

__sfr __no_bit_access __no_init volatile const union
{
  unsigned char RESF;
  __BITS8       RESF_bit;
} @ 0xFFFA8;

__sfr __no_init volatile union
{
  unsigned char LVIM;
  __BITS8       LVIM_bit;
  struct
  {
    unsigned char  LVD0F:1;
    unsigned char  LVD1F:1;
    unsigned char  DLVD0F:1;
    unsigned char  DLVD1F:1;
    unsigned char  :3;
    unsigned char  LVISEN:1;
  };
} @ 0xFFFA9;

__sfr __no_init volatile union
{
  unsigned char LVIS;
  __BITS8       LVIS_bit;
  struct
  {
    unsigned char  :6;
    unsigned char  LVD1SEL:1;
    unsigned char  LVD1EN:1;
  };
} @ 0xFFFAA;

__sfr __no_bit_access __no_init volatile union
{
  unsigned char WDTE;
  __BITS8       WDTE_bit;
} @ 0xFFFAB;

__sfr __no_bit_access __no_init volatile union
{
  unsigned char CRCIN;
  __BITS8       CRCIN_bit;
} @ 0xFFFAC;

__sfr __no_init volatile union
{
  unsigned short IF2;
  __BITS16       IF2_bit;
  struct
  {
    union
    {
      unsigned char IF2L;
      __BITS8       IF2L_bit;
      struct
      {
        unsigned char  TMIF05:1;
        unsigned char  TMIF06:1;
        unsigned char  TMIF07:1;
        unsigned char  PIF6:1;
        unsigned char  PIF7:1;
        unsigned char  PIF8:1;
        unsigned char  PIF9:1;
        unsigned char  FLIF:1;
      };
    };
    union
    {
      unsigned char IF2H;
      __BITS8       IF2H_bit;
      struct
      {
        unsigned char  CMPIF0:1;
        unsigned char  CMPIF1:1;
        unsigned char  TMIF10:1;
        unsigned char  TMIF11:1;
        unsigned char  TMIF12:1;
        unsigned char  SREIF3:1;
        unsigned char  CTSUWRIF:1;
        unsigned char  IICAIF1:1;
      };
      struct
      {
        unsigned char  PIF10:1;
        unsigned char  PIF11:1;
        unsigned char  UREIF0:1;
        unsigned char  UREIF1:1;
        unsigned char  :1;
        unsigned char  TMIF13H:1;
        unsigned char  :2;
      };
    };
  };
} @ 0xFFFD0;

__sfr __no_init volatile union
{
  unsigned short IF3;
  __BITS16       IF3_bit;
  struct
  {
    union
    {
      unsigned char IF3L;
      __BITS8       IF3L_bit;
      struct
      {
        unsigned char  CTSURDIF:1;
        unsigned char  CTSUFNIF:1;
        unsigned char  REMCIF:1;
        unsigned char  UTIF0:1;
        unsigned char  URIF0:1;
        unsigned char  UTIF1:1;
        unsigned char  URIF1:1;
        unsigned char  TMIF14:1;
      };
    };
    union
    {
      unsigned char IF3H;
      __BITS8       IF3H_bit;
      struct
      {
        unsigned char  TMIF15:1;
        unsigned char  TMIF16:1;
        unsigned char  TMIF17:1;
        unsigned char  :5;
      };
    };
  };
} @ 0xFFFD2;

__sfr __no_init volatile union
{
  unsigned short MK2;
  __BITS16       MK2_bit;
  struct
  {
    union
    {
      unsigned char MK2L;
      __BITS8       MK2L_bit;
      struct
      {
        unsigned char  TMMK05:1;
        unsigned char  TMMK06:1;
        unsigned char  TMMK07:1;
        unsigned char  PMK6:1;
        unsigned char  PMK7:1;
        unsigned char  PMK8:1;
        unsigned char  PMK9:1;
        unsigned char  FLMK:1;
      };
    };
    union
    {
      unsigned char MK2H;
      __BITS8       MK2H_bit;
      struct
      {
        unsigned char  CMPMK0:1;
        unsigned char  CMPMK1:1;
        unsigned char  TMMK10:1;
        unsigned char  TMMK11:1;
        unsigned char  TMMK12:1;
        unsigned char  SREMK3:1;
        unsigned char  CTSUWRMK:1;
        unsigned char  IICAMK1:1;
      };
      struct
      {
        unsigned char  PMK10:1;
        unsigned char  PMK11:1;
        unsigned char  UREMK0:1;
        unsigned char  UREMK1:1;
        unsigned char  :1;
        unsigned char  TMMK13H:1;
        unsigned char  :2;
      };
    };
  };
} @ 0xFFFD4;

