NoMaY-jp/FreeRTOS/FreeRTOS/Demo/RL78_RL78G23_64p_FPB_IAR_e2studio_EWRL78/src/smc_gen/r_bsp/mcu/rl78_g23/register_access/iccrl/ior7f100g.h
__sfr __no_init volatile union
{
  unsigned short MK3;
  __BITS16       MK3_bit;
  struct
  {
    union
    {
      unsigned char MK3L;
      __BITS8       MK3L_bit;
      struct
      {
        unsigned char  CTSURDMK:1;
        unsigned char  CTSUFNMK:1;
        unsigned char  REMCMK:1;
        unsigned char  UTMK0:1;
        unsigned char  URMK0:1;
        unsigned char  UTMK1:1;
        unsigned char  URMK1:1;
        unsigned char  TMMK14:1;
      };
    };
    union
    {
      unsigned char MK3H;
      __BITS8       MK3H_bit;
      struct
      {
        unsigned char  TMMK15:1;
        unsigned char  TMMK16:1;
        unsigned char  TMMK17:1;
        unsigned char  :5;
      };
    };
  };
} @ 0xFFFD6;

__sfr __no_init volatile union
{
  unsigned short PR02;
  __BITS16       PR02_bit;
  struct
  {
    union
    {
      unsigned char PR02L;
      __BITS8       PR02L_bit;
      struct
      {
        unsigned char  TMPR005:1;
        unsigned char  TMPR006:1;
        unsigned char  TMPR007:1;
        unsigned char  PPR06:1;
        unsigned char  PPR07:1;
        unsigned char  PPR08:1;
        unsigned char  PPR09:1;
        unsigned char  FLPR0:1;
      };
    };
    union
    {
      unsigned char PR02H;
      __BITS8       PR02H_bit;
      struct
      {
        unsigned char  CMPPR00:1;
        unsigned char  CMPPR01:1;
        unsigned char  TMPR010:1;
        unsigned char  TMPR011:1;
        unsigned char  TMPR012:1;
        unsigned char  SREPR03:1;
        unsigned char  CTSUWRPR0:1;
        unsigned char  IICAPR01:1;
      };
      struct
      {
        unsigned char  PPR010:1;
        unsigned char  PPR011:1;
        unsigned char  UREPR00:1;
        unsigned char  UREPR01:1;
        unsigned char  :1;
        unsigned char  TMPR013H:1;
        unsigned char  :2;
      };
    };
  };
} @ 0xFFFD8;

__sfr __no_init volatile union
{
  unsigned short PR03;
  __BITS16       PR03_bit;
  struct
  {
    union
    {
      unsigned char PR03L;
      __BITS8       PR03L_bit;
      struct
      {
        unsigned char  CTSURDPR0:1;
        unsigned char  CTSUFNPR0:1;
        unsigned char  REMCPR0:1;
        unsigned char  UTPR00:1;
        unsigned char  URPR00:1;
        unsigned char  UTPR01:1;
        unsigned char  URPR01:1;
        unsigned char  TMPR014:1;
      };
    };
    union
    {
      unsigned char PR03H;
      __BITS8       PR03H_bit;
      struct
      {
        unsigned char  TMPR015:1;
        unsigned char  TMPR016:1;
        unsigned char  TMPR017:1;
        unsigned char  :5;
      };
    };
  };
} @ 0xFFFDA;

__sfr __no_init volatile union
{
  unsigned short PR12;
  __BITS16       PR12_bit;
  struct
  {
    union
    {
      unsigned char PR12L;
      __BITS8       PR12L_bit;
      struct
      {
        unsigned char  TMPR105:1;
        unsigned char  TMPR106:1;
        unsigned char  TMPR107:1;
        unsigned char  PPR16:1;
        unsigned char  PPR17:1;
        unsigned char  PPR18:1;
        unsigned char  PPR19:1;
        unsigned char  FLPR1:1;
      };
    };
    union
    {
      unsigned char PR12H;
      __BITS8       PR12H_bit;
      struct
      {
        unsigned char  CMPPR10:1;
        unsigned char  CMPPR11:1;
        unsigned char  TMPR110:1;
        unsigned char  TMPR111:1;
        unsigned char  TMPR112:1;
        unsigned char  SREPR13:1;
        unsigned char  CTSUWRPR1:1;
        unsigned char  IICAPR11:1;
      };
      struct
      {
        unsigned char  PPR110:1;
        unsigned char  PPR111:1;
        unsigned char  UREPR10:1;
        unsigned char  UREPR11:1;
        unsigned char  :1;
        unsigned char  TMPR113H:1;
        unsigned char  :2;
      };
    };
  };
} @ 0xFFFDC;

__sfr __no_init volatile union
{
  unsigned short PR13;
  __BITS16       PR13_bit;
  struct
  {
    union
    {
      unsigned char PR13L;
      __BITS8       PR13L_bit;
      struct
      {
        unsigned char  CTSURDPR1:1;
        unsigned char  CTSUFNPR1:1;
        unsigned char  REMCPR1:1;
        unsigned char  UTPR10:1;
        unsigned char  URPR10:1;
        unsigned char  UTPR11:1;
        unsigned char  URPR11:1;
        unsigned char  TMPR114:1;
      };
    };
    union
    {
      unsigned char PR13H;
      __BITS8       PR13H_bit;
      struct
      {
        unsigned char  TMPR115:1;
        unsigned char  TMPR116:1;
        unsigned char  TMPR117:1;
        unsigned char  :5;
      };
    };
  };
} @ 0xFFFDE;

__sfr __no_init volatile union
{
  unsigned short IF0;
  __BITS16       IF0_bit;
  struct
  {
    union
    {
      unsigned char IF0L;
      __BITS8       IF0L_bit;
      struct
      {
        unsigned char  WDTIIF:1;
        unsigned char  LVIIF:1;
        unsigned char  PIF0:1;
        unsigned char  PIF1:1;
        unsigned char  PIF2:1;
        unsigned char  PIF3:1;
        unsigned char  PIF4:1;
        unsigned char  PIF5:1;
      };
    };
    union
    {
      unsigned char IF0H;
      __BITS8       IF0H_bit;
      struct
      {
        unsigned char  CSIIF20:1;
        unsigned char  CSIIF21:1;
        unsigned char  SREIF2:1;
        unsigned char  ELCLIF:1;
        unsigned char  SMSEIF:1;
        unsigned char  CSIIF00:1;
        unsigned char  TMIF00:1;
        unsigned char  SREIF0:1;
      };
      struct
      {
        unsigned char  IICIF20:1;
        unsigned char  IICIF21:1;
        unsigned char  TMIF11H:1;
        unsigned char  :2;
        unsigned char  IICIF00:1;
        unsigned char  :1;
        unsigned char  TMIF01H:1;
      };
      struct
      {
        unsigned char  STIF2:1;
        unsigned char  SRIF2:1;
        unsigned char  :3;
        unsigned char  STIF0:1;
        unsigned char  :2;
      };
    };
  };
} @ 0xFFFE0;

__sfr __no_init volatile union
{
  unsigned short IF1;
  __BITS16       IF1_bit;
  struct
  {
    union
    {
      unsigned char IF1L;
      __BITS8       IF1L_bit;
      struct
      {
        unsigned char  CSIIF10:1;
        unsigned char  CSIIF11:1;
        unsigned char  SREIF1:1;
        unsigned char  IICAIF0:1;
        unsigned char  CSIIF01:1;
        unsigned char  TMIF01:1;
        unsigned char  TMIF02:1;
        unsigned char  TMIF03:1;
      };
      struct
      {
        unsigned char  IICIF10:1;
        unsigned char  IICIF11:1;
        unsigned char  TMIF03H:1;
        unsigned char  :1;
        unsigned char  IICIF01:1;
        unsigned char  :3;
      };
      struct
      {
        unsigned char  STIF1:1;
        unsigned char  SRIF1:1;
        unsigned char  :2;
        unsigned char  SRIF0:1;
        unsigned char  :3;
      };
    };
    union
    {
      unsigned char IF1H;
      __BITS8       IF1H_bit;
      struct
      {
        unsigned char  ADIF:1;
        unsigned char  RTCIF:1;
        unsigned char  ITLIF:1;
        unsigned char  KRIF:1;
        unsigned char  CSIIF30:1;
        unsigned char  CSIIF31:1;
        unsigned char  TMIF13:1;
        unsigned char  TMIF04:1;
      };
      struct
      {
        unsigned char  :4;
        unsigned char  IICIF30:1;
        unsigned char  IICIF31:1;
        unsigned char  :2;
      };
      struct
      {
        unsigned char  :4;
        unsigned char  STIF3:1;
        unsigned char  SRIF3:1;
        unsigned char  :2;
      };
    };
  };
} @ 0xFFFE2;

